<script>
import HomeHeaderVue from "@/components/HomeHeader.vue";

export default {
  name: "HomeView",
  components: {
    HomeHeaderVue, // Регистрируйте компонент здесь
  },
};
</script>

<template>
  <div id="home">
    <HomeHeaderVue></HomeHeaderVue>
    <!-- eslint-disable -->
    <!-- Дополнительное содержание для домашней страницы -->
    <div class="page-content">
      <h2>Добро пожаловать в нашу систему управления учебным планом</h2>
      <p>
        Наша система позволяет вам легко управлять и просматривать учебные модули и курсы. Независимо от того, являетесь ли вы студентом или преподавателем, вы найдете инструменты, необходимые для успешного обучения.
      </p>
      <div>
        <h3>Основные функции:</h3>
        <ul class="custom-list">
          <li>Легкое планирование и организация учебного плана.</li>
          <li>Просмотр и открытие разнообразных учебных модулей.</li>
          <li>Управление курсами, отслеживание прогресса и доступ к ресурсам.</li>
          <li>Сотрудничество с коллегами-преподавателями и студентами.</li>
          <li>Оптимизация коммуникации и получение информации об обновлениях.</li>
        </ul>
      </div>
      <h3>Начните использовать:</h3>
      <p>
        Готовы начать свой учебный путь? Зарегистрируйтесь или войдите в систему, чтобы начать. Если у вас возникнут вопросы или потребуется помощь, наша служба поддержки всегда готова помочь.
      </p>

      <!-- Добавьте больше содержания или разделов по мере необходимости -->
    </div>
  </div>
</template>

<style>
body {
  margin: 0;
}

#home {
  font-family: Avenir, Helvetica, Arial, sans-serif;
  -webkit-font-smoothing: antialiased;
  -moz-osx-font-smoothing: grayscale;
  text-align: center;
  color: #2c3e50;
}

.page-content {
  margin: 10px;
  padding: 10px;
  background-color: #e9e9e9; /* Светло-серый цвет фона для контента */
  border-radius: 5px;
  box-shadow: 0 2px 4px rgba(0, 0, 0, 0.1);
}

.page-content h2 {
  font-size: 24px;
  margin-bottom: 10px;
}

.page-content p {
  font-size: 16px;
}

/* Пользовательский стиль для элементов списка */
.custom-list {
  list-style-type: none; /* Уберите стандартные маркеры списка */
  padding-left: 0; /* Уберите стандартный левый отступ */
}

.custom-list li {
  margin-bottom: 8px; /* Добавьте интервал между элементами списка */
  text-align: center; /* Выровняйте текст в каждом элементе списка по центру */
}

.custom-list li::before {
  content: "\2022"; /* Используйте пользовательский символ маркера (в данном случае - точку) */
  color: #3c66aa; /* Установите цвет пользовательского маркера */
  font-weight: bold; /* Необязательно: сделайте маркер жирным */
  position: relative; /* Положение относительно пользовательского маркера */
  left: 0; /* Подгоните положение пользовательского маркера, чтобы выровнять его с текстом */
  margin-right: 5px; /* Добавьте интервал между маркером и текстом */
}
</style>
